tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "hudochenkov/sshpass"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Java-based scripting language
brew "groovy"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# LastPass command-line interface tool
brew "lastpass-cli"
# Java-based project management
brew "maven"
# Menu-driven communications program
brew "minicom"
# Text-based UI library
brew "ncurses"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Extract, view, and test RAR archives
brew "unrar"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
brew "hudochenkov/sshpass/sshpass"
# Electronics prototyping platform
cask "arduino", args: { appdir: "/Applications" }
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# E-books management software
cask "calibre", args: { appdir: "/Applications" }
# Two-panel file manager
cask "commander-one", args: { appdir: "/Applications" }
# Client for the Dropbox cloud storage service
cask "dropbox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "font-menlo-for-powerline", args: { appdir: "/Applications" }
# 3D mapping application
cask "garmin-basecamp"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
cask "google-backup-and-sync", args: { appdir: "/Applications" }
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Java IDE by JetBrains
cask "intellij-idea", args: { appdir: "/Applications" }
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters", args: { appdir: "/Applications" }
# Office suite
cask "microsoft-office", args: { appdir: "/Applications" }
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams", args: { appdir: "/Applications" }
cask "nodemcu-pyflasher"
# Programmable solid 3D CAD modeller
cask "openscad"
# G-code generator for 3D printers
cask "orcaslicer"
# Free and open source media center
cask "osmc"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Centralises all remote connections on a single platform
cask "remote-desktop-manager-free", args: { appdir: "/Applications" }
# Video chat, voice call and instant messaging application
cask "skype", args: { appdir: "/Applications" }
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
cask "slate", args: { appdir: "/Applications" }
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Development environment
cask "vagrant", args: { appdir: "/Applications" }
# Virtualiser for x86 hardware
cask "virtualbox", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp", args: { appdir: "/Applications" }
# Network protocol analyzer
cask "wireshark-app"
vscode "dhoeric.ansible-vault"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
