cask_args appdir: '/Applications'

tap 'AdoptOpenJDK/openjdk'
tap 'hashicorp/tap'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'hudochenkov/sshpass'

brew 'coreutils'
brew 'git'
brew 'git-lfs'
cask 'adoptopenjdk8'
cask 'adoptopenjdk11'
brew 'gradle'
brew 'groovy'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/packer'
brew 'jenv'
brew 'jq'
brew 'lastpass-cli'
brew 'maven'
brew 'nvm'
brew 'p7zip'
brew 'python'
brew 'sshpass'
brew 'ssh-copy-id'
brew 'telnet'
brew 'terragrunt'
brew 'tig'
brew 'unrar'
brew 'wakeonlan'
brew 'wget'
brew 'zsh'

cask 'commander-one'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'figma'
cask 'font-hack-nerd-font'
cask 'font-menlo-for-powerline'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'logitech-control-center'
cask 'menumeters'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'ngrok'
cask 'powershell'
cask 'remote-desktop-manager-free'
cask 'skype'
cask 'slack'
cask 'slate'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'
cask 'zoomus'
