cask_args appdir: '/Applications'

tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'hudochenkov/sshpass'

brew 'azure-cli'
brew 'coreutils'
brew 'git'
brew 'git-lfs'
cask 'adoptopenjdk8'
brew 'gradle'
brew 'groovy'
brew 'jenv'
brew 'jq'
brew 'kubernetes-cli'
brew 'lastpass-cli'
brew 'maven'
brew 'openssl'
brew 'p7zip'
brew 'python'
brew 'python@2'
brew 'sshpass'
brew 'ssh-copy-id'
brew 'terraform'
brew 'telnet'
brew 'tig'
brew 'unrar'
brew 'wget'
brew 'zsh'

cask 'commander-one'
cask 'docker'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'font-hack-nerd-font'
cask 'font-menlo-for-powerline'
cask 'intellij-idea'
cask 'iterm2'
cask 'logitech-control-center'
cask 'menumeters'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'remote-desktop-manager-free'
cask 'skype'
cask 'skype-for-business'
cask 'slack'
cask 'slate'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vmware-remote-console'
cask 'whatsapp'
cask 'wireshark'
